; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v2 ?v13)
             (pred_7 ?v10 ?v12)
             (pred_11 ?v2 ?v12)
             (pred_5 ?v3 ?v2 )
	     (pred_3 ?v2)
             (pred_1 ?v11)
             (pred_4 ?v10)
             (pred_2 ?v12)
             (pred_8 ?v2)
             (pred_6 ?v10)
             (pred_10 ?v2)
             (pred_12 ))



(:action op_4
:parameters (?v1 ?v7 ?v9 ?v6)
:precondition (and (pred_1 ?v1) (pred_1 ?v7) (pred_4 ?v9) (pred_2 ?v6)
          (pred_9 ?v1 ?v7) (pred_7 ?v9 ?v6)
                   (pred_11 ?v7 ?v6) (pred_3 ?v1) 
                   (pred_8 ?v7) (pred_6 ?v9))
:effect (and  (pred_10 ?v7) (not (pred_8 ?v7))))


(:action op_3
:parameters (?v1 ?v8)
:precondition (and (pred_1 ?v1) (pred_1 ?v8)
               (pred_3 ?v1) (pred_9 ?v1 ?v8) (pred_10 ?v8))
:effect (and (pred_3 ?v8) (not (pred_3 ?v1))))

(:action op_5
:parameters (?v1 ?v9)
:precondition (and (pred_1 ?v1) (pred_4 ?v9) 
                  (pred_3 ?v1) (pred_5 ?v9 ?v1) (pred_12 ))
:effect (and (pred_6 ?v9)
   (not (pred_5 ?v9 ?v1)) (not (pred_12 ))))


(:action op_1
:parameters (?v1 ?v4 ?v5)
:precondition (and (pred_1 ?v1) (pred_4 ?v4) (pred_4 ?v5)
                  (pred_3 ?v1) (pred_6 ?v5) (pred_5 ?v4 ?v1))
:effect (and (pred_6 ?v4) (pred_5 ?v5 ?v1)
        (not (pred_6 ?v5)) (not (pred_5 ?v4 ?v1))))

(:action op_2
:parameters (?v1 ?v9)
:precondition (and (pred_1 ?v1) (pred_4 ?v9) 
                  (pred_3 ?v1) (pred_6 ?v9))
:effect (and (pred_12 ) (pred_5 ?v9 ?v1) (not (pred_6 ?v9)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_15 obj_08 obj_22 obj_18 obj_02 obj_09 obj_14 obj_16 obj_11 obj_06 obj_07 obj_17 obj_03 obj_04 obj_20
    obj_10 obj_12 obj_21
    obj_19 obj_13 obj_05
    )

    (:init
       (pred_12)

       (pred_1 obj_01)
       (pred_1 obj_15)
       (pred_1 obj_08)
       (pred_1 obj_22)
       (pred_1 obj_18)
       (pred_1 obj_02)
       (pred_1 obj_09)
       (pred_1 obj_14)
       (pred_1 obj_16)
       (pred_1 obj_11)
       (pred_1 obj_06)
       (pred_1 obj_07)
       (pred_1 obj_17)
       (pred_1 obj_03)
       (pred_1 obj_04)
       (pred_1 obj_20)
       (pred_2 obj_10)
       (pred_2 obj_12)
       (pred_2 obj_21)
       (pred_4 obj_19)
       (pred_4 obj_13)
       (pred_4 obj_05)

       (pred_9 obj_01 obj_18)
       (pred_9 obj_01 obj_15)
       (pred_9 obj_15 obj_02)
       (pred_9 obj_15 obj_08)
       (pred_9 obj_15 obj_01)
       (pred_9 obj_08 obj_09)
       (pred_9 obj_08 obj_22)
       (pred_9 obj_08 obj_15)
       (pred_9 obj_22 obj_14)
       (pred_9 obj_22 obj_08)
       (pred_9 obj_18 obj_16)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_18 obj_01)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_02 obj_09)
       (pred_9 obj_02 obj_15)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_09 obj_06)
       (pred_9 obj_09 obj_14)
       (pred_9 obj_09 obj_08)
       (pred_9 obj_09 obj_02)
       (pred_9 obj_14 obj_07)
       (pred_9 obj_14 obj_22)
       (pred_9 obj_14 obj_09)
       (pred_9 obj_16 obj_17)
       (pred_9 obj_16 obj_11)
       (pred_9 obj_16 obj_18)
       (pred_9 obj_11 obj_03)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_11 obj_16)
       (pred_9 obj_06 obj_04)
       (pred_9 obj_06 obj_07)
       (pred_9 obj_06 obj_09)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_07 obj_20)
       (pred_9 obj_07 obj_14)
       (pred_9 obj_07 obj_06)
       (pred_9 obj_17 obj_03)
       (pred_9 obj_17 obj_16)
       (pred_9 obj_03 obj_04)
       (pred_9 obj_03 obj_11)
       (pred_9 obj_03 obj_17)
       (pred_9 obj_04 obj_20)
       (pred_9 obj_04 obj_06)
       (pred_9 obj_04 obj_03)
       (pred_9 obj_20 obj_07)
       (pred_9 obj_20 obj_04)
       (pred_8 obj_16)
       (pred_8 obj_08)
       (pred_8 obj_20)
       (pred_11  obj_16 obj_10)
       (pred_11  obj_08 obj_12)
       (pred_11  obj_20 obj_21)
       (pred_10 obj_01)
       (pred_10 obj_15)
       (pred_10 obj_22)
       (pred_10 obj_18)
       (pred_10 obj_02)
       (pred_10 obj_09)
       (pred_10 obj_14)
       (pred_10 obj_11)
       (pred_10 obj_06)
       (pred_10 obj_07)
       (pred_10 obj_17)
       (pred_10 obj_03)
       (pred_10 obj_04)

       (pred_7  obj_19 obj_10)
       (pred_7  obj_13 obj_12)
       (pred_7  obj_05 obj_21)
       (pred_5 obj_19 obj_18)
       (pred_5 obj_13 obj_14)
       (pred_5 obj_05 obj_04)
       (pred_3 obj_02)
    )

    (:goal (and
       (pred_5 obj_19 obj_01)
       (pred_5 obj_13 obj_17)
       (pred_5 obj_05 obj_09)
    ))
(:constraints
  (always (not (pred_3 obj_16)))
)
)

; plan
1. (op_3 obj_02 obj_18)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_18)
   goals met: 0 of 3
2. (op_5 obj_18 obj_19)
   deleted: (pred_5 obj_19 obj_18) (pred_12)
   added: (pred_6 obj_19)
   goals met: 0 of 3
3. (op_3 obj_18 obj_02)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_02)
   goals met: 0 of 3
4. (op_3 obj_02 obj_09)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_09)
   goals met: 0 of 3
5. (op_2 obj_09 obj_19)
   deleted: (pred_6 obj_19)
   added: (pred_12) (pred_5 obj_19 obj_09)
   goals met: 0 of 3
6. (op_3 obj_09 obj_14)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_14)
   goals met: 0 of 3
7. (op_5 obj_14 obj_13)
   deleted: (pred_5 obj_13 obj_14) (pred_12)
   added: (pred_6 obj_13)
   goals met: 0 of 3
8. (op_3 obj_14 obj_09)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_09)
   goals met: 0 of 3
9. (op_3 obj_09 obj_06)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_06)
   goals met: 0 of 3
10. (op_3 obj_06 obj_04)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_04)
   goals met: 0 of 3
11. (op_3 obj_04 obj_03)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_03)
   goals met: 0 of 3
12. (op_3 obj_03 obj_17)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_17)
   goals met: 0 of 3
13. (op_2 obj_17 obj_13)
   deleted: (pred_6 obj_13)
   added: (pred_12) (pred_5 obj_13 obj_17)
   goals met: 1 of 3
14. (op_3 obj_17 obj_03)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_03)
   goals met: 1 of 3
15. (op_3 obj_03 obj_04)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_04)
   goals met: 1 of 3
16. (op_5 obj_04 obj_05)
   deleted: (pred_5 obj_05 obj_04) (pred_12)
   added: (pred_6 obj_05)
   goals met: 1 of 3
17. (op_3 obj_04 obj_06)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_06)
   goals met: 1 of 3
18. (op_3 obj_06 obj_09)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_09)
   goals met: 1 of 3
19. (op_1 obj_09 obj_19 obj_05)
   deleted: (pred_6 obj_05) (pred_5 obj_19 obj_09)
   added: (pred_6 obj_19) (pred_5 obj_05 obj_09)
   goals met: 2 of 3
20. (op_3 obj_09 obj_02)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_02)
   goals met: 2 of 3
21. (op_3 obj_02 obj_15)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_15)
   goals met: 2 of 3
22. (op_3 obj_15 obj_01)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_01)
   goals met: 2 of 3
23. (op_2 obj_01 obj_19)
   deleted: (pred_6 obj_19)
   added: (pred_12) (pred_5 obj_19 obj_01)
   goals met: 3 of 3
